EDT/УТ/src/Reports/ОтчетПоИнтервалам/ОтчетПоИнтервалам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоИнтервалам</name>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УбратьЗаборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интервал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

EDT/УТ/src/Reports/ОтчетПоИнтервалам/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	
	СхемаКомпоновкиДанных.Параметры.ГруппаРайоновКАД.Значение  =  
		
	СхемаКомпоновкиДанных.Параметры.ПериодОтчета.Значение = ПериодОтчета;
	НастройкиОтчета = СхемаКомпоновкиДанных.ВариантыНастроек[ВариантОтчета].Настройки;
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение = Справочники.ГруппыРайонов.НайтиПоКоду("00000000030");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.ГруппыРайонов.НайтиПоКоду("00000000052");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[5].Значение = ПериодОтчета;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[6].Значение = Интервал;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[6].Использование = Истина;
		
	
	Если ЗначениеЗаполнено(Партнер) Тогда 
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = Истина;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Партнер;
	Иначе	
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Водитель) Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = Истина;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = Водитель;
	Иначе	
		КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Терминал) Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование  = Истина;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ПравоеЗначение = Терминал;
	Иначе
		КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование  = Ложь;	
	КонецЕсли;	
	Если ЗначениеЗаполнено(Причина) И ВариантОтчета = 0 Тогда 
		КомпоновщикНастроек.Настройки.Отбор.Элементы[4].Использование  = Истина;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[4].ПравоеЗначение = Причина;
	ИначеЕсли ВариантОтчета = 0 Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[4].Использование  = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Статус) И ВариантОтчета = 0 Тогда 
		КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование  = Истина;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ПравоеЗначение = Статус;
	ИначеЕсли ВариантОтчета = 0 Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование  = Ложь;
	КонецЕсли;
	Если УбратьЗаборы И ВариантОтчета = 1 Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[4].Использование  = Истина;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[4].ПравоеЗначение = "Доставка";
	ИначеЕсли ВариантОтчета = 1 Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[4].Использование  = Ложь;
	КонецЕсли;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
